10_Forms/starter_code/ShirtsApp/app/controllers/shirts_controller.rb

INSERT INTO "shirts" ("created_at", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 06 Jan 2016 04:47:45 UTC +00:00], ["description", "d"], ["image", "d"], ["name", "d"], ["updated_at", Wed, 06 Jan 2016 04:47:45 UTC +00:00]]
---
  def create
    @shirt = Shirt.new(safe_shirt_params)
    if @shirt.save()

SELECT "shirts".* FROM "shirts" WHERE "shirts"."id" = 0 LIMIT 1
---
  def show
    @shirt = Shirt.find_by_id(params[:id])